
function wm(id,n){
	if( n.length > 20 ){ return; }
	var m = Math.floor(n.length / 2), lf = n.substring(0, m), rg = n.substring(m);
	var s = new Array(163);
s[0]="$nꦿ℘゜এ"
s[1]="$lfོ$rgꦿ℘゜এ"
s[2]="ζั͡$lfั͡$rgั͡✾ ั"
s[3]="ζั͡$lfζั͡$rg"
s[4]="ღ$n᭄ꦿ࿐"
s[5]="$nོ꧔ꦿ"
s[6]="⸐꯭$lf꯭$rg꯭⸙"
s[7]="$lfོ$rg͡ꦿ᭄"
s[8]="చ꯭$lf꯭⃧$rg꯭⃧"
s[9]="$n͡ꦿ๑҉"
s[10]="$lf⃤$rg⃤"
s[11]="☄$n☄"
s[12]="$n⃨࿚໌້ᮨ"
s[13]="$n⃨࿚᪲"
s[14]="$n⃕࿙࿚ཻ"
s[15]="$lf̶$rg̶م"
s[16]="$lfຼ$rg໌້ᮨ"
s[17]="$nه٥"
s[18]="$lf໌້ᮨ⃟$rg໌້ᮨ"
s[19]="$lfོ$rg͜❀҉"
s[20]="$nེꦿ๑҉"
s[21]="༄$lfོ࿆$rgོ࿆༅"
s[22]="༄༊࿆$nོྂཾ࿆࿐"
s[23]="LᎭₑ$lf꯭$rgོﻬ࿚ᔉ"
s[24]="$lf̶͠$rg̶ོ͠็ꦿﻬ"
s[25]="$nིꦿྀز"
s[26]="☾⋆᭄$lf໌້ᮨ$rg໌້ᮨ⋆"
s[27]="⁰ʚ$lfོ$rg⁰ɞ"
s[28]="꯭☪꯭᭄ꦿ꯭$lf꯭$rg꯭"
s[29]="$nꦿૢ"
s[30]="ℒℴѵℯ·$lf·$rg·ꦿ໊ོ"
s[31]="Ꮉ⃰$lfꦿ$rg⃰"
s[32]="$lf᭱$rg᭱ꦿএ"
s[33]="$n͙͙͙͙͡ꦿ᭄͙͙͙͙᪴࿐᪴"
s[34]="ͮ$n͡ꦿ໌້۵"
s[35]="$lf̶$rg̶ ͜ ໑"
s[36]="ༀ꧁꫞$lf࿅࿆$rg꫞꧂ༀ"
s[37]="༺ۣۖ$lfۣۖ༒ۣ$rgۣۖ༻"
s[38]="꧁꫞꯭$lf꯭$rg꯭꫞꧂"
s[39]="ღ$n͡ꦿ᭄࿐"
s[40]="$lf້໌ᮩ$rg̶͡ꦿ̶̶᭄͡ꦿ̶̶᭄→"
s[41]="$lf້໌ᮩ$rgꦿ᭄࿐"
s[42]="$lfྀ$rgྀ"
s[43]="$lfཻ$rgཻ࿐"
s[44]="ৡ$lfᮨ$rgོꦿ࿐"
s[45]="এ᭄$nོꦿ࿐"
s[46]="$lf̸$rg̸"
s[47]="ʚ$lf̶$rg̶͜♥̶م"
s[48]="థ͡$n᭄゛ঞ"
s[49]="༗$lfཻ$rgཻ࿐"
s[50]="ღ$nོꦿ࿐"
s[51]="এ᭄$nོꦿృ༊"
s[52]="☂゛$nꦿ"
s[53]="☪᭄$lf°$rgོꦿ࿐"
s[54]="ꕥ᭄$nꦿঞ"
s[55]="ල᭄$nꦿ᭄࿐"
s[56]="$lf᭄ོꦿ$rg᭄ོꦿ"
s[57]="̶$lf̶$rg̶ﮒ"
s[58]="✎ℳ₯㎕$n"
s[59]= "꧁$n꧂";
s[60]= "꧁༺$n༻꧂";
s[61]= "꧁༺๑$n๑༻꧂";
s[62]= "༺ཌༀൢ$lf༒$rgൢༀད༻";
s[63]= "꧁༺△$lfཊ࿈ཏ$rg△༻꧂";
s[64]= "꧁༺$lf࿈$rg༻꧂";
s[65]= "꧁$lf♝$rg꧂";
s[66]= "꧁༺๑$n๑༻꧂";
s[67]= "꧁❦༺$lf༒$rg༻❦꧂";
s[68]= "꧁༺༽༾ཊ$lf࿈$rgཏ༿༼༻꧂";
s[69]= "꧁༺❀ൢ$lf༒$rgൢ❀༻꧂";
s[70]= "꧁༺$lf༒$rg༻꧂";
s[71]= "꧁❀$lf༒$rg❀꧂";
s[72]= "ༀ꧁꫞$lf࿅࿆$rg꫞꧂ༀ";
s[73]= "༺ཌༀൢ$nൢༀད༻";
s[74] = "༺ཉི།$n།ཉྀ༻";
s[75] = "༺༃$lf༒$rg༃༻";
s[76] = "༺࿈$n࿈༻";
s[77] = "༄༊$nོྂཾ࿆࿐";
s[78] = "༺ཌༀ$nༀད༻";
s[79] = "༺❦$lf༒$rg❦༻";
s[80] = "༄༊࿆$nོཾ࿆࿐ ";
s[81]= "ৡ$nོꦿ࿐";
s[82]= "ঞ$nꦿ᭄";
s[83]= "〆$nじò ぴé╰";
s[84]= "☂゛$nꦿ";
s[85]= "じ☆ve$n♥";
s[86]= "ღ$nོꦿ࿐";
s[87]= "♂$n♂";
s[88]= "❣$n╰☆ぷ";
s[89]= "ৡ$nৡ࿐";
s[90]= "ζั͡ޓއއއ$n☺";
s[91]= "এ᭄$nོꦿృ༊";
s[92]= "←￠$n☆";
s[93]= "♀$n♂";
s[94]= "╃$nメ";
s[95]= "ε⺌$n⺌ε";
s[96]= "༺༒$n˶⍤⃝˶ᵒ༻";
s[97]= "ৡ$nััꦿ᭄ﻬ࿐";
s[98]= "༺ۣۖ$nۣۖ༻";
s[99]= "༗$nཻ࿐`";
s[100]= "✎ℳ₯㎕$n";
s[101]= "LᎭₑ$nﻬ࿚ᔉ";
s[102]= "ઇ$nଓ";
s[103]= "҉✿$nꦿﻬ";
s[104]= "ꕥ᭄$nꦿঞ";
s[105]= "﹌★`$n✘";
s[106]= "⁰ʚ$n⁰ɞ";
s[107]= "༄༊࿆$nོྂཾ࿆࿐";
s[108]= "ゞ$nゞ";
s[109]= "╰╮$n╭╯";
s[110]= "༺༒$n༒༻";
s[111]= "▓卐$n卍▓";
s[112]= "☆$n☆";
s[113]= "༺❦$n❦༻";
s[114]= "ℳ₯㎕﹅$nゝ";
s[115]= "ওؓ$nཱིއއ";
s[116]= "༄༊࿆$n࿐";
s[117]= "─━═$nζ";
s[118]= "〆$nএ⁵²º᭄";
s[119]= "☄$n☄";
s[120]= "ଲ$nঞ";
s[121]= "$nه٥";
s[122]= "↭$nཱིއއ";
s[123]= "ζั͡ޓއؓ$n٭";
s[124]= "დ$n⁵²º⅓¼";
s[125]= "ั͡ζั$nζั͡✾";
s[126]= "ぺ$nぺ";
s[127]= "ꦼജ$n♡";
s[128]= "▃▂$n_﹏";
s[129]= "﹎.$n℃";
s[130]= "﷼$nོꦿ❧";
s[131]= "༻❥$nꦼꦿ";
s[132]= "╃$n╃";
s[133]= "◥◣$n◢◤";
s[134]= "҈$n҈";
s[135]= "—━╋う$n╰☆╮";
s[136]= "じ☆ve$n灬";
s[137]= "⿹$noο﹏";
s[138]= "⿺$n√。";
s[139]= "◢▂$n▂◣";
s[140]= "এ$nしovё";
s[141]= "＊﹏$n〆…";
s[142]= "╭Д灬$n";
s[143]= "╬═☆$nぺo";
s[144]= "ℒฺℴฺνℯ̶ฺ$n⋆";
s[145]= "ও$nꦿ゛";
s[146]= "〾$nバ⿻";
s[147]= "←№1 $n~→☆";
s[148]= "ゞ$noо";
s[149]= "✾$nꦿ࿐ ";
s[150]= "←═╬∞$n~`";
s[151]= "ㄣ$n╰☆ぷ";
s[152]= "〃$nぐ";
s[153]= "♀$n♀";
s[154]= "☜$n☞";
s[155]= "┽→$n﹏.";
s[156]= "●//$n▲ッ";
s[157]= "★$n﹌";
s[158]= "㊣$n㊣";
s[159]= "づ$n╄→";
s[160]= "ζั͡์$n✾";
s[161]= "✎﹏ℳ๓₯㎕$n";
s[162]= "ミ$nōベ";
s[163]= "■$n▄︻┻┳═一";
s[164]= "(_灬$n﹋﹌";
s[165]= "圝◤$n◥圝";
s[166]= "oo-┈$n℡~";
s[167]= "◣$n◥";



	return s[id].replace("$lf", lf).replace("$rg", rg).replace("$n", n);
}
function df(id,n){
	if( n.length > 20 ){ return; }
	var m = Math.floor(n.length / 2), n1 = n.substring(0, m), n2 = n.substring(m);
	var s = new Array(32);
	s[0] = "꧁$n꧂";
	s[1] = "꧁༺$n༻꧂";
	s[2] = "꧁༺๑$n๑༻꧂";
	s[3] = "༺ཌༀൢ$n1༒$n2ൢༀད༻";
	s[4] = "꧁༺△$n1ཊ࿈ཏ$n2△༻꧂";
	s[5] = "꧁༺$n1࿈$n2༻꧂";
	s[6] = "꧁$n1♝$n2꧂";
	s[7] = "꧁༺๑$n๑༻꧂";
	s[8] = "꧁❦༺$n1༒$n2༻❦꧂";
	s[9] = "꧁༺༽༾ཊ$n1࿈$n2ཏ༿༼༻꧂";
	s[10] = "꧁༺❀ൢ$n1༒$n2ൢ❀༻꧂";
	s[11] = "꧁༺$n1༒$n2༻꧂";
	s[12] = "꧁❀$n1༒$n2❀꧂";
	s[13] = "ༀ꧁꫞$n1࿅࿆$n2꫞꧂ༀ";
	s[14] = "ʚ$nɞ";
	s[15] = "ε$nз";
	s[16] = "ʚ$n1ΐ$n2ɞ";
	s[17] = "ઇ$nଓ";
	s[18] = "ε$n1ï$n2з";
	s[19] = "༺$n1༒$n2༻";
	s[20] = "⊱$n⊰";
	s[21] = "◥$n◤";
	s[22] = "☜$n☞";
	s[23] = "༺$n༻";
	s[24] = "༺ཌༀཉི$n1༒$n2༃ༀད༻";
	s[25] = "༺ཉི།$n།ཉྀ༻";
	s[26] = "༺༃$n1༒$n2༃༻";
	s[27] = "༺࿈$n࿈༻";
	s[28] = "༄༊$nོྂཾ࿆࿐";
	s[29] = "༺ཌༀ$nༀད༻";
	s[30] = "༺❦$n1༒$n2❦༻";
	s[31] = "༄༊࿆$nོཾ࿆࿐ ";
	return s[id].replace("$n1", n1).replace("$n2", n2).replace("$n", n)
}

function cf() {
	var s = document.getElementById("txt").value.toString(), temp = '';
	for (var i = 0, l = s.length; i < l; i++) {
		temp += '<dd><a href="javascript:;" onclick="ins(\'' + s.charAt(i) + '\')">' + s.charAt(i) + '</a><i class="zi-copy" data-clipboard-text="' + s.charAt(i) + '" onclick="copy(\'.zi-copy\')">复制</i><i onclick="ins(\'' + s.charAt(i) + '\')">使用</i></dd>';
	}
	document.getElementById("cj").innerHTML = temp;
}
function OnEnter( field ) { if( field.value == field.defaultValue ) { field.value = ""; } }
function OnExit( field ) { if( field.value == "" ) { field.value = field.defaultValue; } }